app/controllers/hotels_controller.rb

  def index
    if user_signed_in?
      if params[:reset_search]
        current_user.update_attributes hotel_search_query: ''
        params.delete :reset_search
      end

      unless params[:hotel] || params[:per_page]
        if current_user.save_hotel_search_query and current_user.hotel_search_query and !current_user.hotel_search_query.empty?
---
SELECT COUNT(*) FROM "hotels"
SELECT name FROM "hotels"