app/views/hotels/_show_main.html.haml


      - resource.filter_values.each do |value|
---
SELECT "hotel_filter_values".* FROM "hotel_filter_values" WHERE "hotel_filter_values"."hotel_id" = 1043

      - filter_item_ids = resource.filter_values.pluck(:item_id)
      - resource.service_values.sort{ |a, b| a.service.position <=> b.service.position }.each do |value|
---
SELECT "hotel_service_values".* FROM "hotel_service_values" WHERE "hotel_service_values"."hotel_id" = 1043


    - resource.bank_attributes.each do |a|
      .well
---
SELECT "hotel_bank_attributes".* FROM "hotel_bank_attributes" WHERE "hotel_bank_attributes"."hotel_id" = 1043