app/views/hotels/_show_special_offers.html.haml

    .items
      - if resource.special_offers.count > 0
        .accordion#special-offers-accordion
          .accordion-group
            .accordion-heading
---
SELECT COUNT(*) FROM "hotel_special_offers" WHERE "hotel_special_offers"."hotel_id" = 1043