app/views/hotels/index.html.haml

            %td= hotel.city
            - hotel.filter_values.each do |value|
---
SELECT "hotel_filter_values".* FROM "hotel_filter_values" WHERE "hotel_filter_values"."hotel_id" = 585